app/controllers/reclamantes_controller.rb

  def index
    @reclamantes = Reclamante.all
---
SELECT * FROM `reclamantes`

  def show
    @reclamante = Reclamante.find(params[:id])
---
SELECT * FROM `reclamantes` WHERE (`reclamantes`.`id` = 2)

  def edit
    @reclamante = Reclamante.find(params[:id])
---
SELECT * FROM `reclamantes` WHERE (`reclamantes`.`id` = 1)

  def create
    @reclamante = Reclamante.new(params[:reclamante])

    respond_to do |format|
      if @reclamante.save
---
INSERT INTO `reclamantes` (`Numero_Ordem`, `Sequencial`, `Nome_Reclamante`, `Data_Nascimento`, `Nome_Mae`, `Nome_Pai`, `Endereco`, `Complemento`, `Bairro`, `Cidade`, `CEP`, `UF`, `matricula`, `Codigo_Funcao`, `Lotacao`, `CTPS`, `serie`, `UF_CTPS`, `Local_trabalhado`, `periodo_inicial1`, `periodo_final1`, `periodo_inicial2`, `periodo_final2`, `periodo_inicial3`, `periodo_final3`, `periodo_inicial4`, `periodo_final4`, `created_at`, `updated_at`) VALUES(2.0, 1, 'novo reclamante', '', '', '', '', '', '', '', '', '', '', NULL, '', '', '', '', '', '2009-07-16', '2009-07-16', '2009-07-16', '2009-07-16', '2009-07-16', '2009-07-16', '2009-07-16', '2009-07-16', '2009-07-16 02:26:52', '2009-07-16 02:26:52')

  def update
    @reclamante = Reclamante.find(params[:id])

    respond_to do |format|
      if @reclamante.update_attributes(params[:reclamante])
---
SELECT * FROM `reclamantes` WHERE (`reclamantes`.`id` = 1)
UPDATE `reclamantes` SET `Complemento` = '', `matricula` = '', `Local_trabalhado` = '', `updated_at` = '2009-07-19 23:41:37' WHERE `id` = 12

  def destroy
    @reclamante = Reclamante.find(params[:id])
    @reclamante.destroy
---
SELECT * FROM `reclamantes` WHERE (`reclamantes`.`id` = 1)
DELETE FROM `reclamantes` WHERE `id` = 1

  def search
    @query = params[:nome].to_s.upcase
    @reclamante = Reclamante.find(:all, :conditions => ["Nome_Reclamante like ?", "#{@query}%"  ])
---
SELECT * FROM `reclamantes` WHERE (Nome_Reclamante like 'Ben')